# Coding Homework 2: [Qasim Raza F2023266144]




## The TITANIC Tragedy
At the time it departed from England in April 1912, the RMS Titanic was the largest ship in the world. In the night of April 14th to April 15th, the Titanic struck an iceberg and sank approximately 600km south of Newfoundland (a province in eastern Canada). Many people perished in this accident. Data about the passengers who were on board the Titanic at the time of the accident is available in the "titanic.csv" file.

In [ ]:
# Import/Load Put the "titanic.csv" data

In [48]:
import pandas as pd
titanic = pd.read_csv("titanic.csv")
titanic

,Name,Survived,Boarded,Class,MWC,Age,Adut_or_Chld,Sex,Paid,Ticket_No,Boat_or_Body,Job,Class_Dept,Class_Full
0,"ABBING, Mr Anthony",Dead,Southampton,3,Man,42.0,Adult,Male,7.550,5547,NaN,Blacksmith,3rd Class Passenger,3
1,"ABBOTT, Mr Ernest Owen",Dead,Southampton,Crew,Man,21.0,Adult,Male,NaN,NaN,NaN,Lounge Pantry Steward,Victualling Crew,V
2,"ABBOTT, Mr Eugene Joseph",Dead,Southampton,3,Child,14.0,Child,Male,20.250,CA2673,NaN,Scholar,3rd Class Passenger,3
3,"ABBOTT, Mr Rossmore Edward",Dead,Southampton,3,Man,16.0,Adult,Male,20.250,CA2673,[190],Jeweller,3rd Class Passenger,3
4,"ABBOTT, Mrs Rhoda Mary 'Rosa'",Alive,Southampton,3,Woman,39.0,Adult,Female,20.250,CA2673,A,NaN,3rd Class Passenger,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2203,"ZAKARIAN, Mr Ortin",Dead,Cherbourg,3,Man,27.0,Adult,Male,7.225,2670,NaN,General Labourer,3rd Class Passenger,3
2204,"ZANETTI, Sig. Minio",Dead,Southampton,Crew,Man,20.0,Adult,Male,NaN,NaN,NaN,Assistant Waiter,Restaurant Staff,R
2205,"ZARRACCHI, Sig. L.",Dead,Southampton,Crew,Man,26.0,Adult,Male,NaN,NaN,NaN,Wine Butler,Restaurant Staff,R
2206,"ZENNI, Mr Philip",Alive,Cherbourg,3,Man,22.0,Adult,Male,7.225,2620,6,General Labourer,3rd Class Passenger,3
2207,"ZIMMERMANN, Mr Leo",Dead,Southampton,3,Man,29.0,Adult,Male,7.875,315082,NaN,Farmer,3rd Class Passenger,3

### Q0: How many missing data values are there in the `Age` column
> Hint: Remember `.isnull().sum()`?

In [49]:
titanic['Age'].isnull().sum()

np.int64(3)

In [50]:
# Since many of their values are missing or unclear,
# modify the `titanic` data frame by removing the following variables:
# `Ticket_No`, `Boat_or_Body`, `Class_Dept`, `Class_Full`.

# Hint 1: https://letmegooglethat.com/?q=how+to+remove+columns+from+a+pandas+data+frame
# Hint 2: ` is different than "
# Hint 3: use `inplace=True`

titanic.drop(['Ticket_No', 'Boat_or_Body', 'Class_Dept', 'Class_Full'], axis=1, inplace=True)

In [51]:
titanic.columns

Index(['Name', 'Survived', 'Boarded', 'Class', 'MWC', 'Age', 'Adut_or_Chld',
       'Sex', 'Paid', 'Job'],
      dtype='object')

### Q1: What is the dimension of the titantic data set after removing the four columns above?
> Hint: Remember the `.shape` attribute?

In [52]:
# Q1: your answer will be tested!
# Q1 = (None,None) # Assign a `tuple` of two integers to Q1
# e.g., (1,2) for 1 row and 2 columns
Q1 = titanic.shape 
Q1

(2208, 10)

- The variable `Adut_or_Chld` indicates which passengers were adults and which were children. Change the name of this variable to `Adult_or_Child`.
- `MWC` is a little more specific, recording whether the passenger was a man, woman or child. To make this variable name clearer, change the name of `MWC` to `Man_Woman_or_Child`.

In [53]:
# Hint 1: https://letmegooglethat.com/?q=how+to+rename+pandas+columns
# Hint 2: use `inplace=True`

titanic.rename(columns={
    'Adut_or_Chld': 'Adult_or_Child',
    'MWC': 'Man_Woman_or_Child'
}, inplace=True)

In [54]:
titanic.head()

,Name,Survived,Boarded,Class,Man_Woman_or_Child,Age,Adult_or_Child,Sex,Paid,Job
0,"ABBING, Mr Anthony",Dead,Southampton,3,Man,42.0,Adult,Male,7.55,Blacksmith
1,"ABBOTT, Mr Ernest Owen",Dead,Southampton,Crew,Man,21.0,Adult,Male,NaN,Lounge Pantry Steward
2,"ABBOTT, Mr Eugene Joseph",Dead,Southampton,3,Child,14.0,Child,Male,20.25,Scholar
3,"ABBOTT, Mr Rossmore Edward",Dead,Southampton,3,Man,16.0,Adult,Male,20.25,Jeweller
4,"ABBOTT, Mrs Rhoda Mary 'Rosa'",Alive,Southampton,3,Woman,39.0,Adult,Female,20.25,NaN

### Q2 What is the data type of the following object?

```python
{'Adut_or_Chld':'Adult_or_Child', 'MWC':'Man_Woman_or_Child'}
```

A. `dict`  
B. `list`  
C. `tuple`  
D. `str`

In [55]:
# Q2: your answer will be tested!
Q2 = None # Assign either 'A' or 'B' or 'C' or 'D' to `Q2` instead of `None`
# E.g., Q1 = 'A'
a={'Adut_or_Chld':'Adult_or_Child', 'MWC':'Man_Woman_or_Child'}
type(a)
 # ANS Q1='A'

dict

### Q3: How many passengers were there on the Titanic (`n`) and how many survied (`n_surv`), and what was the survival percentage (`prop_surv`)?
> - Hint 1: The line of code below does something called ***coercion***. Try running the line of code to examine what exactly **coercion** is: `True+True, True+False, True, False, type(True+True), type(True+False), type(True), type(False)`
>
>
> - Hint 2: Don't forget about logical (`boolean`) conditional operatators... They can transform entire pandas columns! For example, try `(titanic_data['Survived']=='Alive')`
>
>
> - Hint 3: Columns can also be selected like this `titanic_data.Age` and the `.sum()` method can be applied on a single `pandas` column like this `titanic_data.Age.sum()`

In [56]:
# Q3: your answer will be tested!
n = len(titanic)  # number of passengers on the the titanic
n_surv = (titanic['Survived'] == 'Alive').sum()  # number of the passengers survived
prop_surv = n_surv/n # proportion of passengers that survived
Q3 = (n, n_surv,prop_surv) # Assign a `tuple` of three numeric values to Q3
Q3

(2208, np.int64(712), np.float64(0.322463768115942))

### Q4: What were the proportion of deaths for men, women, and children, respectively?

#### Provide ALL numeric answers included in your answer `tuple` as `float`  (or the analogous `numpy.float64`) type values <br>rounded to three decimal places.

> Hints:
> - Start with `(d.Survived!='Alive')`  
>
>
> - A proportion is a `.mean()` of $0$'s and $1$'s  
>
>
> - Remember ***coercion*** with `True` and `False` data types
>
>
> - Use `.groupby(titanic_data.Man_Woman_or_Child)` and you can add the `.mean()` method onto the end of this action...
>
>
> - After importing `numpy` as `import numpy as np` you can round with `np.round(0.1234,3)`

In [58]:
import numpy as np
titanic['Man_Woman_or_Child'].unique()

array(['Man', 'Child', 'Woman'], dtype=object)

In [60]:

death_proportions = (titanic['Survived'] != 'Alive').groupby(titanic['Man_Woman_or_Child']).mean()


prop_die_men = np.round(death_proportions['Man'], 3)
prop_die_women = np.round(death_proportions['Woman'], 3)
prop_die_children = np.round(death_proportions['Child'], 3)

Q4 = (prop_die_men, prop_die_women, prop_die_children)
Q4

(np.float64(0.806), np.float64(0.243), np.float64(0.484))

### Q5: What was the proportion of deaths for passengers between 25-40 years of age?

#### Provide ALL numeric answers as `float` (or the analogous `numpy.float64`) type values rounded to three decimal places.

> Hints:
> - Assume "between" is inclusive so that you use `>=` and `<=`
>
>
> - Suppose you have two columns of conditions, `column_of_TrueFalse_1` and `column_of_TrueFalse_1`: you can require
>   - both be true using `column_of_TrueFalse_1 & column_of_TrueFalse_2`
>   - or either to be true using `column_of_TrueFalse_1 | column_of_TrueFalse_2`

In [61]:
age_filter = (titanic['Age'] >= 25) & (titanic['Age'] <= 40)

In [64]:
# Q5: your answer will be tested!
Q5 = None # Assign a `float` numeric value to Q5
# Round to 3 decimal places using `np.round(0.1234,3)`

death_25_40 = (titanic['Survived'] != 'Alive')  # True if passenger died
prop_die_25_40 = np.round(death_25_40[age_filter].mean(), 3)
Q5 = prop_die_25_40
Q5

np.float64(0.693)

### Q6: What was the proportion of deaths for men, women, and children among passengers who paid more than 50 British pounds for their tickets?

#### Provide ALL numeric answers included in your answer `tuple` as `float`  (or the analogous `numpy.float64`) type values <br>rounded to three decimal places.


> Hint: "more than" here is strict so use `>`; and, assume the `Paid` column is in British pounds.

In [66]:
rich_passengers = titanic['Paid'] > 50
died = titanic['Survived'] != 'Alive'
death_rich_grouped = died[rich_passengers].groupby(titanic['Man_Woman_or_Child'][rich_passengers]).mean()

In [67]:
prop_die_men_richtix = np.round(death_rich_grouped['Man'], 3)
prop_die_women_richtix = np.round(death_rich_grouped['Woman'], 3)
prop_die_children_richtix = np.round(death_rich_grouped['Child'], 3)

Q6 = (prop_die_men_richtix, prop_die_women_richtix, prop_die_children_richtix)
# Assign a `tuple` of three `float`s to Q6, e.g., `(0.123, 0.456, 0.789)`... watch out 9, 7 bites!
Q6

(np.float64(0.7), np.float64(0.032), np.float64(0.538))

### Q7: Write several sentences comparing and contrasting your results for Q6 relative to Q4.
Provide your written answer in the markdown cell below.
- This will be manually reviewed.

> Answer here...
Passengers who paid more than 50 pounds had lower death proportions across all groups compared to the overall population. Wealthier men, women, and children all showed higher survival rates, suggesting that socioeconomic status influenced survival chances. While women and children were prioritized in general, wealth further increased the likelihood of survival for everyone.

### Q8: What was the most common job among passengers of the Titanic?

A. General Labourer  
B. Fireman  
C. Trimmer  
D. Saloon Steward

Write 1-2 sentences explaining the code used to produce your answer in the markdown cell below.
- This will be reviewed manually.

> Hint 1: the `groupby`, `.size()`, or  and `sort_values()` methods would be helpful...  
> Hint 2: or the `value_counts()` would be helpful...  
> Hint 3: https://letmegooglethat.com/?q=how+do+I+sort+a+pandas+data+frame+by+a+column

> Answer here...I used the value_counts() method to count how many passengers had each job, then idxmax() to select the job with the highest count. This efficiently identifies the most frequent job among all passengers.
> optin c

In [ ]:
# Cell for scratch work to figure out the answers above...
# You could add additional cell if you need to below here with the "+" button in the toolbar below the menu bar

In [ ]:
# Q8: your answer will be tested!
Q8 = None # Assign either 'A' or 'B' or 'C' or 'D' to `Q2` instead of `None`
# E.g., Q1 = 'A'

Q8=option c

### Q9: Were any of the general labourers on the titanic women? If so, how many?

In [68]:
# Q9: your answer will be tested!
Q9 = None # Assign an integer value to Q9
# E.g., Q9 = 1

Q9 = ((titanic['Job'] == 'General Labourer') & (titanic['Man_Woman_or_Child'] == 'Woman')).sum()

Q9

np.int64(1)

### Q10: What are the names of the passengers with the top 4 most expensive tickets? Did these passengers survive the accident?

Output a table with four rows for this question.
- This will be reviewed manually.

> Hint: use `.head(4)`

In [69]:

top_tickets = titanic[['Name', 'Paid', 'Survived']].sort_values(by='Paid', ascending=False).head(4)

top_tickets

                                   Name        Paid Survived
334       CARDEZA, Mrs Charlotte Wardle  512.329167    Alive
333   CARDEZA, Mr Thomas Drake Martinez  512.329167    Alive
1176             LESUEUR, Mr Gustave J.  512.329167    Alive
2077             WARD, Miss Annie Moore  512.329167    Alive

### Q11: Write a couple paragraphs paraphrasing the output of the code in the cell below.

Don't spend more than 15 minutes on this.
- This will be reviewed manually.


> Hints:
> - `mean` is the "average"
> - `std` stands for "standard deviation" and measures the spead of the data
> - `min` and `max` are the smallest and largest values, respectively
> - The percentages are "percentiles"; so, e.g., the 50th percentile is the "median"

In [70]:
pd.read_csv("titanic.csv").rename(columns={'MWC':'Man_Woman_or_Child'}).groupby('Man_Woman_or_Child').describe()

                       Age                                                 \
                     count       mean        std    min   25%   50%   75%
Man_Woman_or_Child
Child                124.0   6.184597   4.297938   0.08   2.0   5.5   9.0
Man                 1649.0  31.482717  10.373889  15.00  24.0  30.0  38.0
Woman                432.0  31.925926  11.882998  15.00  22.0  29.5  40.0

                           Paid                                             \
                     max  count       mean        std       min        25%
Man_Woman_or_Child
Child               14.0  123.0  33.204274  33.436297  3.170833  15.900000
Man                 74.0  786.0  24.862749  42.493309  0.000000   7.805208
Woman               64.0  409.0  48.609887  67.216995  0.000000   9.587500


                          50%    75%         max
Man_Woman_or_Child
Child               25.466667  32.75  262.375000
Man                 10.335417  26.25  512.329167
Woman               21.075000  59.40  512.329167

> Answer here...  The summary statistics show differences among men, women, and children. Children are younger on average, while men and women have higher ages. Ticket prices vary widely across all groups, as seen from the large standard deviations and the range between minimum and maximum values. Percentiles highlight how most passengers’ ages and fares are distributed. Overall, the table provides a clear view of the age and wealth patterns among men, women, and children on the Titanic.